Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K03.tmx
Source language: en_us
Languages: zh_cn

source: Where the Red Fern Grows (by Wilson Rawls)
zh_cn: 红蕨生长在哪里（威尔逊·罗尔斯 著）

source: I SUPPOSE THERE'S A TIME IN PRACTICALLY EVERY YOUNG boy's life when he's affected by that wonderful disease of puppy love.
zh_cn: 我想，几乎每个小男孩生命里都有过那样一段时光——病得不轻，深深沉迷于“小狗狗的爱”。

source: I don't mean the kind a boy has for the pretty little girl that lives down the road.
zh_cn: 我说的不是男孩子对住在路那头的小女孩那种小狗狗式的爱。

source: I mean the real kind, the kind that has four small feet and a wig-gly tail, and sharp little teeth that can gnaw on a boy's finger; the kind a boy can romp and play with, even eat and sleep with.
zh_cn: 我说的是真的那种，是长着四只小脚丫、一条扭动的尾巴和一口能咬住男孩手指的小尖牙的那种，是男孩子能和它一起玩耍打闹、甚至一起吃饭睡觉的那种。

source: I was ten years old when I first became infected with this terrible disease.
zh_cn: 十岁那年，我头一次患上了这种病。

source: I'm sure no boy in the world had it worse than I did.
zh_cn: 我敢说世上没有哪个男孩像我病得那么厉害。

source: It's not easy for a young boy to want a dog and not be able to have one.
zh_cn: 想要只狗却没法得到，这对一个小男孩来说并非易事。

source: It starts gnawing on his heart, and gets all mixed up in his dreams.
zh_cn: 渴望开始噬咬他的心，在他的梦里纠缠不休。

source: It gets worse and worse, until finally it becomes almost unbearable.
zh_cn: 渴望越来越厉害，直到最终变得简直难以承受。

source: If my dog-wanting had been that of an ordinary boy, I'm sure my mother and father would have gotten me a puppy, but my wants were different.
zh_cn: 假如我的恋狗症和普通男孩一样的话，那我相信我的父母会给我一只小狗的，但我的渴望却不同。

source: I didn't want just one dog.
zh_cn: 我不想要单单一只狗。

source: I wanted two, and not just any kind of a dog.
zh_cn: 我想要两只，而且不是任何品种的狗都行。

source: They had to be a special kind and a special breed.
zh_cn: 它们必须是一个特别的品种。

source: I had to have some dogs.
zh_cn: 我必须有几只狗。

source: I went to my father and had a talk with him.
zh_cn: 我去找父亲谈话。

source: He scratched his head and thought it over.
zh_cn: 他挠着头细细考虑了一番。

source: "Well, Billy," he said, "I heard that Old Man Hatfield's collie is going to have pups.
zh_cn: “好吧，比利，”他说，“我听说‘老头帽’农场的牧羊犬要生小崽了。

source: I'm sure I can get one of them for you."
zh_cn: 我肯定能给你弄一只过来。”

source: He may as well have poured cold water on me.
zh_cn: 他的话就像给我泼了一盆冷水。

source: "Papa," I said, "I don't want an old collie dog.
zh_cn: “爸爸，”我说，“我不想要一只老牧羊犬。

source: I want hounds-coon hounds-and I want two of them."
zh_cn: 我想要猎犬——浣熊猎犬——而且我想要两只。”

source: I could tell by the look on his face that he wanted to help me, but couldn't.
zh_cn: 从他脸上的表情我能看得出，他想帮我，但无能为力。

source: He said, "Billy, those kind of dogs cost money, and that's something we don't have right now.
zh_cn: 他说：“比利，那样的狗要花钱，而我们现在正缺钱。

source: Maybe some day when we can afford it, you can have them, but not right now."
zh_cn: 也许有一天我们能付得起价钱的时候，你就可以拥有它们，但现在不行。”

source: I didn't give up.
zh_cn: 我没有放弃。

source: After my talk with Papa, I went to Mama.
zh_cn: 和爸爸谈过之后，我又找了妈妈。

source: I fared no better there.
zh_cn: 我没在她那里讨到好。

source: Right off she said I was too young to be hunting with hounds.
zh_cn: 她马上说我还太小，不能带猎犬去打猎。

source: Besides, a hunter needed a gun, and that was one thing I couldn't have, not until I was twenty-one anyway.
zh_cn: 此外，一名猎手需要一杆枪，而那是我还不能持有的东西，要到我二十一岁才行。

source: I couldn't understand it.
zh_cn: 我难以理解。

source: There I was sitting right in the middle of the finest hunting country in the world and I didn't even have a dog.
zh_cn: 我身处世界上最好的狩猎之乡，却连一只狗都没有。

source: Our home was in a beautiful valley far back in the rugged Ozarks.
zh_cn: 我们家在地势崎岖的奥扎克高地一个美丽的山谷里。

source: The country was new and sparsely settled.
zh_cn: 这个小村是新近建立的，人口稀少。

source: The land we lived on was Cherokee land, allotted to my mother because of the Cherokee blood that flowed in her veins.
zh_cn: 我们居住的土地原属切罗基人领地，分配给我们是因为母亲血管里流淌着切罗基族的血液。

source: It lay in a strip from the foothills of the mountains to the banks of the Illinois Biver in northeastern Oklahoma.
zh_cn: 那是俄克拉荷马州东北部从山脉丘陵到伊利诺伊河畔的一条狭长土地。

source: The land was rich, black, and fertile.
zh_cn: 这块土地黝黑肥沃，产量很高。

source: Papa said it would grow hair on a crosscut saw.
zh_cn: 爸爸说，它能让木锯子上都抽出芽来。

source: He was the first man to stick the cold steel point of a turning plow into the virgin soil.
zh_cn: 他是头一个把冰冷刚硬的犁尖耕进这块处女地的人。

source: Mama had picked the spot for our log house.
zh_cn: 我们的木屋建在妈妈挑选的地点。

source: It nestled at the edge of the foothills in the mouth of a small canyon, and was surrounded by a grove of huge red oaks.
zh_cn: 那在一个小溪谷谷口的丘陵边缘，被一小片红橡木环绕。

source: Behind our house one could see miles and miles of the mighty Ozarks.
zh_cn: 屋后可以望见绵延的奥扎克高地。

source: In the spring the aromatic scent of wild flowers, redbuds, papaws, and dogwoods,drifting on the wind currents, spread over the valley and around our home.
zh_cn: 一到春天，野花、紫荆、番木瓜和山茱萸的芬芳随风而动，飘满整个溪谷和我的家园。

source: Below our fields, twisting and winding, ran the clear blue waters of the Illinois River.
zh_cn: 在我们的农场下方，伊利诺伊河清澈碧蓝的河水蜿蜒流过。

source: The banks were cool and shady.
zh_cn: 河岸旁树木成荫。

source: The rich bottom land near the river was studded with tall sycamores, birches, and box elders.
zh_cn: 肥沃的河滩地上散布着高大的美国梧桐、白桦树和白蜡槭。

source: To a ten-year-old country boy it was the most beautiful place in the whole wide world, and I took advantage of it all.
zh_cn: 对一个十岁的乡下男孩来说，这算得上全世界最美的地方了，我没有浪费这个优势。

source: I roamed the hills and the river bottoms.
zh_cn: 我常在山野间河岸旁漫游。

source: I knew every game trail in the thick cane-brakes, and every animal track that was pressed in the mud along the riverbanks.
zh_cn: 我知道浓密丛林里的每一条兽道，认识河岸边的泥地里每一种动物的足迹。

source: The ones that fascinated me the most were the baby-like tracks of a river coon.
zh_cn: 其中最吸引我的是一种河浣熊留下的婴儿似的脚印。

source: I'd lie for hours examining them.
zh_cn: 我会趴在地上对它们研究上几个小时。

source: Before leaving, I'd take a switch and sweep them all away.
zh_cn: 离开前，我会折一根软树枝，扫净地上的足印。

source: These I called my "trail looks."
zh_cn: 我把这称为我的“兽道观察”。

source: The next day I'd hurry back, and sure enough, nine times out of ten, there in the clean-swept ground I would again find the tracks of a ringtail coon.
zh_cn: 隔天我赶回来，十之八九会在扫干净的地面上再次发现浣熊的足迹。

source: I knew he had passed over the trail during the night.
zh_cn: 我知道它在夜里曾走过兽道。

source: I could close my eyes and almost see him, humped up and waddling along, fishing under the banks with his delicate little paws for crawfish, frogs, and minnows.
zh_cn: 我几乎闭上眼睛就能看见它的模样，奔窜着，身体摇摆，在下面的河滩上用它灵活的小爪子抓螯虾、青蛙和小鱼吃。

source: I was a hunter from the time I could walk.
zh_cn: 我自打会走路起，就是个猎人。

source: I caught lizards on the rail fences, rats in the corncrib, and frogs in the little creek that ran through the fields. I was a young Daniel Boone.
zh_cn: 我在栅栏上捉蜥蜴，在玉米囤里抓老鼠，还在流过田地的小溪里捕青蛙。我是个小丹尼尔·布恩。（Daniel Boone：传奇人物，开拓肯州的先锋）

source: As the days passed, the dog-wanting disease grew worse.
zh_cn: 随着时间流逝，我的恋狗症愈演愈烈。

source: I began to see dogs in my sleep.
zh_cn: 我开始在梦里看见狗儿们的身影。

source: I went back to my father and mother.
zh_cn: 我又去找了父亲和母亲。

source: It was the same old story.
zh_cn: 情况依然如故。

source: Good hounds cost money, and they just didn't have it.
zh_cn: 好猎犬要花钱，而他们没钱。

source: My dog-wanting became so bad I began to lose weight and my food didn't taste good any more.
zh_cn: 我的恋狗症变得如此强烈，以致于体重都开始下降，也吃不下饭。

source: Mama noticed this and she had a talk with Papa.
zh_cn: 妈妈注意到了，她和爸爸谈了一次。

source: "You're going to have to do something," she said. "I never saw a boy grieve like that.
zh_cn: “你该做点什么，”她说，“我从没见过一个男孩难过成那样。

source: It's not right, not right at all."
zh_cn: 这不对劲，非常不对劲。”

source: "I know," said Papa, "and I feel just as badly as you do, but what can I do? You know we don't have that kind of money."
zh_cn: “我知道，”爸爸说，“我和你一样着急，可我能做什么呢？你知道我们没有派那种用途的钱。”

source: "I don't care," said Mama. "You've got to do something.
zh_cn: “我不管。”妈妈说，“你得做点什么。

source: I can't stand to see him cry like that.
zh_cn: 我不能眼睁睁看着他哭成那样。

source: Besides he's getting to be a problem.
zh_cn: 另外，他开始成问题了。

source: I can't get my work done.
zh_cn: 我都没法干活了。

source: He follows me around all day long begging for hounds."
zh_cn: 他整天跟着我，巴巴地就想要几只猎犬。”

source: "I offered to get him a dog," said Papa, "but he doesn't want just any kind of dog.
zh_cn: “我提议过给他弄只狗，”爸爸说，“可他不只是想要随便什么狗。

source: He wants hounds, and they cost money.
zh_cn: 他想要猎犬，猎犬要花钱的。

source: Do you know what the Parker boys paid for those two hounds they bought? Seventy-five dollars!
zh_cn: 你知道帕克家的男孩们买那两只猎犬花了多少钱吗？七十五美元！

source: If I had that much money, I'd buy another mule.
zh_cn: 要是我有那么多钱，我早就另买一头骡子了。

source: I sure do need one."
zh_cn: 我肯定我们需要一头。”

source: I had overheard this conversation from another room.
zh_cn: 我在隔壁房间无意中听到了这次对话。

source: At first it made me feel pretty good.
zh_cn: 一开头这让我感觉非常好。

source: At least I was getting to be a problem.
zh_cn: 至少我开始是个问题了。

source: Then I didn't feel so good.
zh_cn: 后来我就不觉得那么好了。

source: I knew my mother and father were poor and didn't have any money.
zh_cn: 我知道母亲和父亲很穷，没有钱。

source: I began to feel sorry for them and myself.
zh_cn: 我开始为他们也为我自己难过。

source: After thinking it over, I figured out a way to help.
zh_cn: 重新考虑以后，我想了个办法。

source: Even though it was a great sacrifice, I told Papa I had decided I didn't want two hounds.
zh_cn: 虽然这是一个很大的牺牲。我告诉爸爸，我决定不要两只猎犬了。

source: One would be enough.
zh_cn: 一只就够了。

source: I saw the hurt in his eyes.
zh_cn: 我在他眼中看见了痛苦的神色。

source: It made me feel like someone was squeezing water out of my heart.
zh_cn: 这叫我觉得仿佛有人掏空了我的心。

source: Papa set me on his lap and we had a good talk.
zh_cn: 爸爸把我抱到膝头上，我们好好聊了一回。

source: He told me how hard times were, and that it looked like a man couldn't get a fair price for anything he raised.
zh_cn: 他告诉我现在是多么艰难的时期，种出的庄稼很难卖到好价钱。

source: Some of the farmers had quit farming and were cutting railroad ties so they could feed their families.
zh_cn: 有些农民放弃了耕作，靠砍伐铺铁路的枕木养家糊口。

source: If things didn't get better, that's what he'd have to do.
zh_cn: 要是情况再没有好转，他也只好去做那样的事。

source: He said he'd give anything if he could get some good hounds for me, but there didn't seem to be any way he could right then.
zh_cn: 他说要是能办到他也想给我弄几只好猎犬，但现在他显然无能为力。

source: I went off to bed with my heart all torn up in little pieces, and cried myself to sleep.
zh_cn: 我带着一颗破碎的心爬上床，哭着睡着了。

source: The next day Papa had to go to the store.
zh_cn: 第二天爸爸去商店采购。

source: Late that evening I saw him coming back.
zh_cn: 晚上我看见他回来。

source: As fast as I could, I ran to meet him, expecting a sack of candy.
zh_cn: 我用我最快的速度奔向他，期望能得到一袋糖果。

source: Instead he handed me three small steel traps.
zh_cn: 但他递给我的是三个小号捕兽夹。

source: If Santa Claus himself had come down out of the mountains, reindeer and all, I would not have been more pleased.
zh_cn: 就是圣诞老人本人从大山里、驯鹿上或别的什么地方走过来，我也不会更高兴了。

source: I jumped up and down, and cried a whole bucketful of tears.
zh_cn: 我又蹦又跳，喜极而泣。

source: I hugged him and told him what a wonderful papa he was.
zh_cn: 我搂着他对他说他是一个多棒的老爸。

source: He showed me how to set them by mashing the spring down with my foot, and how to work the trigger.
zh_cn: 他向我演示如何用脚踩住弹簧安置捕兽夹，扳机又是如何被触发的。

source: I took them to bed with me that night.
zh_cn: 那天夜里，我上床都抱着它们。

source: The next morning I started trapping around the barn.
zh_cn: 第二天早晨，我就开始在谷仓附近下套子。

source: The first thing I caught was Samie, our house cat.
zh_cn: 逮住的第一只猎物竟是萨米，我们的猫。

source: If this didn't cause a commotion! I didn't intend to catch him.
zh_cn: 那真是好一场骚乱！我没打算抓它。

source: I was trying to catch a rat, but somehow he came nosing around and got in my trap.
zh_cn: 我想逮的是耗子，可它不知怎么跑到附近，踩进了我下的夹子。

source: My sisters started bawling and yelling for Mama.
zh_cn: 我的妹妹们大喊着叫妈妈。

source: She came running, wanting to know what in the world was going on.
zh_cn: 她跑过来，想知道到底出了什么事。

source: None of us had to tell her, Samie told her with his spitting and squalling.
zh_cn: 我们都不必向她解释什么了。萨米的挣扎嚎叫说明了一切。

source: He was mad.
zh_cn: 它发了疯。

source: He couldn't understand what that thing was that was biting his foot, and he was making an awful fuss about it.
zh_cn: 它闹不明白是什么东西在咬它的脚，被吓得不轻。

source: His tail was as big as a wet corncob and every hair on his small body was sticking straight up.
zh_cn: 它的尾巴蓬得像个玉米穗，瘦小的身体上每一根毛都炸了起来。

source: He spit and yowled and dared anyone to get close to him.
zh_cn: 它又是喷唾沫又是嚎叫，不让人靠近。

source: My sisters yelled their fool heads off, all the time saying, "Poor Samie! Poor Samie!"
zh_cn: 我的妹妹们摇晃着蠢脑袋，齐声叫着：“可怜的萨米！可怜的萨米！”

source: Mama shushed them up and told me to go get the forked stick from under the clothesline.
zh_cn: 妈妈让她们闭嘴，叫我去拿晾衣绳下面的晾衣杆。

source: I ran and got it.
zh_cn: 我赶紧跑去取了来。

source: Mama was the best helper a boy ever had.
zh_cn: 妈妈是一个男孩此刻能找到的最好帮手了。

source: She put the forked end over Samie's neck and pinned him to the ground.
zh_cn: 她用晾衣杆叉住萨米的脖子，把它摁在地上。

source: It was bad enough for the trap to be biting his foot, but to have his neck pinned down that way was too much.
zh_cn: 脚被夹子咬住就已经够惨了，如今脖子又被叉住，萨米气疯了。

source: He threw a fit. I never heard such a racket in all my life.
zh_cn: 它大为发作，我这辈子都没听过那么吓人的嚎叫。

source: It wasn't long until everything on the place was all spooked up.
zh_cn: 不一会儿，农场上的所有动物都被吓着了。

source: The chickens started cackling and flew way up on the hillside.
zh_cn: 鸡开始咯咯叫，纷纷飞上山坡。

source: Daisy, our milk cow, all but tore the barn lot up and refused to give any milk that night.
zh_cn: 奶牛黛西差点把谷仓给掀了，那天晚上一滴奶都没出。

source: Sloppy Ann, our hog, started running in circles, squealing and grunting.
zh_cn: 肥猪胖安妮绕着圈子猛跑，呼噜呼噜地哼唧个不停。

source: Samie wiggled and twisted. He yowled and spit, but it didn't do him any good.
zh_cn: 萨米又挣又扭，嘶叫不已，却无济于事。

source: Mama was good and stout. She held him down, tight to the ground.
zh_cn: 妈妈很有劲，牢牢将它叉在地上。

source: I ran in and put my foot on the trap spring, mashed it down, and released his foot.
zh_cn: 我跑上去踩下弹簧，松开它的脚。

source: With one loud squall, he scooted under the barn.
zh_cn: 它大叫一声，一溜烟逃走了。

source: After it was all over, Mama said, "I don't think you'll have any more trouble with that cat. I think he has learned his lesson."
zh_cn: 一场骚乱结束后，妈妈说：“我想那只猫不会再找你麻烦了，它今天已经尝到苦头了。”

source: How wrong Mama was.
zh_cn: 妈妈猜错了。

source: Samie was one of those nosy kind of cats.
zh_cn: 萨米可不是那种安分的猫。

source: He would lie up on the red oak limbs and watch every move I made.
zh_cn: 它还是会趴在红橡树上，监视我的一举一动。

source: I found some slick little trails out in our garden down under some tall hollyhocks.
zh_cn: 在花园里几株高高的蜀葵下面，我发现了细小的足迹。

source: Thinking they were game trails, and not knowing they were Samie's favorite hunting trails, I set my traps.
zh_cn: 我以为那是兽道，设下了夹子，却不想那竟是萨米最爱走的狩猎路线。

source: Samie couldn't understand what I was doing out there, messing around his hunting territory. He went to investigate.
zh_cn: 它不明白我在它的狩猎区里动了什么手脚，于是上前一探究竟。

source: It wasn't long until I had him limping with all four feet.
zh_cn: 沒多久，萨米四条腿都跛了。

source: Every time Papa saw Samie lying around in the warm sun with his feet wrapped up in turpentine rags, he would laugh until big tears rolled down his cheeks.
zh_cn: 爸爸每次看到萨米脚上包着破布躺在农场里晒太阳，就忍不住笑得眼泪都出来了。

source: Mama had another talk with Papa. She said he was going to have to say something to me, because if I caught that cat one more time, it would drive her out of her mind.
zh_cn: 妈妈又去找了爸爸，让他告诉我，要是我再夹住猫的话，她就要疯了。

source: Papa told me to be a little more careful where I set my traps.
zh_cn: 爸爸嘱咐我下夹子时小心点。

source: "Papa," I said, "I don't want to catch Samie, but he's the craziest cat I ever saw.
zh_cn: “爸爸，”我说，“我也不想抓住萨米，可它是我见过的最不安分的猫。

source: He sees everything I do, and just has to go sniffing around."
zh_cn: 我下夹子的时候它看得清清楚楚，还偏要跑过来闻。”

source: Papa looked over at Samie.
zh_cn: 爸爸朝萨米望了一眼。

source: He was lying all sprawled out in the sunshine with all four paws bandaged and sticking straight up. His long tail was swishing this way and that.
zh_cn: 它四个爪子上都扎着绷带，四脚朝天晒着太阳，长尾巴扫来扫去的。
